БухЭксп/InformationRegisters/CW_DT_ИдентификаторыУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_DT_ИдентификаторыУчастников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_DT_Пароли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_DT_Пароли</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_DT_Синхронизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_DT_Синхронизация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрофильОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_DT_ПрофилиОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_DT_СостоянияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_DT_СостоянияОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обновлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_DT_ТранспортноеСообщениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_DT_ТранспортноеСообщениеИсходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_DT_ПрофилиОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_DT_СостоянияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАрхива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_DT_ТранспортноеСообщениеВходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_DT_ТранспортноеСообщениеВходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_DT_ПрофилиОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_DT_СостоянияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАрхива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Catalogs/CW_DT_ПрофилиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_DT_ПрофилиОбмена</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьСинхронизациюИзУказанныхПрофилей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДляВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложениеКонвертера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьНомераПервичныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИдентификаторыПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучениеПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_РеквизитыГрузоперевозок</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Создание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_DT_Сценарии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправкаПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_РеквизитыГрузоперевозок</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбработчикиВложений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрофильОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_DT_ПрофилиОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_DT/Ext/Module.bsl
#Область functions

Функция СоздатьТранспортноеСообщениеИсходящее(Основание) Экспорт
	
	//проведен?	
	Запрос = Новый Запрос;Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозке.Проведен КАК Проведен,
	|	CW_ДоходыПоГрузоперевозке.Корректировка КАК Корректировка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	Если НЕ Выборка.Проведен Тогда Сообщить("Документ должен быть проведен!");Возврат Неопределено;КонецЕсли; 	
	Если Выборка.Корректировка Тогда Сообщить("Корректировочные документы не обрабатываются!");Возврат Неопределено;КонецЕсли; 	
	
	//Определить продавцов
	//...	
	
	ПрофильОбмена	= ПолучитьПрофильОбмена(Основание);Если ПрофильОбмена = Неопределено Тогда Сообщить("Не обнаружен профиль обмена!");Возврат Неопределено КонецЕсли; 
	Файл			= СформироватьXML(Основание,ПрофильОбмена);Если Файл = Неопределено Тогда Возврат Неопределено;КонецЕсли; 
	НашлиТС 		= ПолучитьТранспортноеСообщениеИсходящее(Основание);
	
	Если НашлиТС = Неопределено Тогда
		ТС = Документы.CW_DT_ТранспортноеСообщениеИсходящее.СоздатьДокумент();
		ТС.Основания.Добавить().Основание = Основание;
	Иначе
		ТС = НашлиТС.ПолучитьОбъект();
	КонецЕсли; 
	
	Попытка
		ТС.Дата				= ТекущаяДата();
		ТС.СостояниеОбмена	= Перечисления.CW_DT_СостоянияОбмена.Создан;
		ТС.ПрофильОбмена	= ПрофильОбмена;
		ТС.Описание			= Основание.ПредставлениеДокумента;
		ТС.Ценность			= Формат(Основание.СуммаДокумента,"ЧДЦ=2") + " " + ?(Основание.Валюта.Код = "643","RUB", Основание.Валюта.Наименование);
		ЗаполнитьЗначенияСвойств(ТС,Основание,"Организация,Контрагент");
		ТС.Записать();
		
		Нашли = ТС.Вложения.Найти("Finance");		
		Если НЕ Нашли = Неопределено Тогда
			Нашли.ОбъектАрхива.ПолучитьОбъект().Удалить();ТС.Вложения.Удалить(Нашли);
		КонецЕсли;  
		
		ПозТочки 	= СтрНайти(Файл,".", НаправлениеПоиска.СКонца);
		Расширение 	= Сред(Файл, ПозТочки); 
		
		ДвоичныеДанные = Новый ДвоичныеДанные(Файл); 
		АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);	

		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Имя",			"Af_finance.xml");
		ДанныеФайла.Вставить("Расширение",	".xml");
		ДанныеФайла.Вставить("Хранение",	АдресФайла);
		
		ПомещенныйФайл = CW_РаботаСФайламиСервер.ПрикрепитьФайл(ДанныеФайла, ТС.Ссылка);
		
		ЗаполнитьЗначенияСвойств(ТС.Вложения.Добавить(),Новый Структура("Тип,ОбъектАрхива","Finance", ПомещенныйФайл));
		
		ТС.Записать();
		
		Возврат ТС.Ссылка
	Исключение
		Сообщить("Что-то пошло не так!");
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Функция ПолучитьТранспортноеСообщениеИсходящее(Основание) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ТранспортноеСообщениеИсходящее.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CW_DT_ТранспортноеСообщениеИсходящее.Основания КАК CW_DT_ТранспортноеСообщениеИсходящее
		|ГДЕ
		|	CW_DT_ТранспортноеСообщениеИсходящее.Основание = &Основание
		|	И CW_DT_ТранспортноеСообщениеИсходящее.Ссылка.СостояниеОбмена = ЗНАЧЕНИЕ(Перечисление.CW_DT_СостоянияОбмена.Создан)";
	Запрос.УстановитьПараметр("Основание", Основание);
	Результат = Запрос.Выполнить();Если Результат.Пустой() Тогда Возврат Неопределено; КонецЕсли; 
	Выборка	= Результат.Выбрать();Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции

Функция ПолучитьТранспортноеСообщениеВходящее(Основание) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ТранспортноеСообщениеВходящее.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CW_DT_ТранспортноеСообщениеВходящее.Основания КАК CW_DT_ТранспортноеСообщениеВходящее
		|ГДЕ
		|	CW_DT_ТранспортноеСообщениеВходящее.Основание = &Основание";
	Запрос.УстановитьПараметр("Основание", Основание);
	Результат = Запрос.Выполнить();Если Результат.Пустой() Тогда Возврат Неопределено; КонецЕсли; 
	Выборка	= Результат.Выбрать();Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции
 
Функция ПолучитьПрофильОбмена(Основание) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ПрофилиОбмена.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CW_DT_ПрофилиОбмена КАК CW_DT_ПрофилиОбмена
		|ГДЕ
		|	CW_DT_ПрофилиОбмена.Организация = &Организация
		|	И CW_DT_ПрофилиОбмена.Контрагент = &Контрагент";
	Запрос.Параметры.Вставить("Организация",Основание.Организация);
	Запрос.Параметры.Вставить("Контрагент",Основание.Контрагент);
	Результат = Запрос.Выполнить();Если Результат.Пустой() Тогда Возврат Неопределено; КонецЕсли; 
	Выборка = Результат.Выбрать();Выборка.Следующий();	
	Возврат Выборка.Ссылка		
КонецФункции

Функция ПолучитьИдентификаторУчастника(Участник) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ИдентификаторыУчастников.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.CW_DT_ИдентификаторыУчастников КАК CW_DT_ИдентификаторыУчастников
		|ГДЕ
		|	CW_DT_ИдентификаторыУчастников.Участник = &Участник";
	Запрос.УстановитьПараметр("Участник", Участник);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	Возврат Выборка.Идентификатор
КонецФункции

Функция ПолучитьУчастникаПоИдентификатору(Идентификатор) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ИдентификаторыУчастников.Участник КАК Участник
		|ИЗ
		|	РегистрСведений.CW_DT_ИдентификаторыУчастников КАК CW_DT_ИдентификаторыУчастников
		|ГДЕ
		|	CW_DT_ИдентификаторыУчастников.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Результат = Запрос.Выполнить();Если Результат.Пустой() Тогда Сообщить("Не обнаружен участник обмена! " + Идентификатор); Возврат Неопределено; КонецЕсли; 
	Выборка = Результат.Выбрать();Выборка.Следующий();	
	Возврат Выборка.Участник
КонецФункции
 
Функция ВернутьАрхив(Сообщение)
	Файл	= ПолучитьИмяВременногоФайла("zip");
	Опись	= КаталогВременныхФайлов()+"\register"+Сообщение.Идентификатор+".txt";
	Архив	= Новый ЗаписьZipФайла(Файл,Сообщение.ПрофильОбмена.ПарольДляВложений);
	Текст	= Новый ТекстовыйДокумент;
	Запрос	= Новый Запрос;Запрос.Текст = 
	"ВЫБРАТЬ
	|	CWEDO_ТранспортноеСообщениеИсходящееВложения.ОбъектАрхива.Ссылка КАК Ссылка,
	|	CWEDO_ТранспортноеСообщениеИсходящееВложения.ОбъектАрхива.ИмяФайла КАК name,
	|	CWEDO_ТранспортноеСообщениеИсходящееВложения.ОбъектАрхива.Расширение КАК ext,
	|	CWEDO_ТранспортноеСообщениеИсходящееВложения.Тип КАК type
	|ИЗ
	|	Документ.CW_DT_ТранспортноеСообщениеИсходящее.Вложения КАК CWEDO_ТранспортноеСообщениеИсходящееВложения
	|ГДЕ
	|	CWEDO_ТранспортноеСообщениеИсходящееВложения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Сообщение.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураАрхива	= Новый Массив; 
	Пока Выборка.Следующий() Цикл
		ОписаниеФайла = Новый Структура("name,ext,type,id",,,,XMLСтрока(Выборка.Ссылка));
		ЗаполнитьЗначенияСвойств(ОписаниеФайла,Выборка);   
		
		ПолноеИмяФайла = CW_РаботаСФайламиСервер.ПолучитьПолноеИмяФайла(Выборка.Ссылка);
		
		Архив.Добавить(ПолноеИмяФайла);
		
		СтруктураАрхива.Добавить(ОписаниеФайла);
	КонецЦикла;     
	
	Текст.УстановитьТекст(jsonObjectToStr(СтруктураАрхива));
	Текст.Записать(Опись);
	Архив.Добавить(Опись);
	Архив.Записать();
	Возврат Файл
КонецФункции

Функция РабочаяБаза() Экспорт
	Возврат Константы.CW_DT_СтрокаСоединенияИнформационнойБазы.Получить() = ВРег(СтрокаСоединенияИнформационнойБазы())		
КонецФункции

Функция ПолучитьПароль(Организация) 
	//УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_Пароли.Пароль КАК Пароль
		|ИЗ
		|	РегистрСведений.CW_DT_Пароли КАК CW_DT_Пароли
		|ГДЕ
		|	CW_DT_Пароли.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();Выборка.Следующий();
		Возврат Выборка.Пароль.Получить()
	Иначе Возврат ""
	КонецЕсли; 	
КонецФункции

Процедура УстановитьПароль(Организация,Пароль) Экспорт
	//УстановитьПривилегированныйРежим(Истина);
	Если Пароль = "" Тогда
		МЗ = РегистрыСведений.CW_DT_Пароли.СоздатьМенеджерЗаписи();
		МЗ.Организация = Организация;
		МЗ.Удалить();
	Иначе 	
		МЗ = РегистрыСведений.CW_DT_Пароли.СоздатьМенеджерЗаписи();
		МЗ.Организация = Организация;
		МЗ.Пароль = Новый ХранилищеЗначения(Пароль,Новый СжатиеДанных(9));
		МЗ.Записать(Истина);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти 
 
#Область http
//Процедура регламентного задания
Процедура ОтправкаТранспортныхСообщений() Экспорт
	Если НЕ РабочаяБаза() Тогда Сообщить("Отпарвка из копии запрещена!");Возврат;КонецЕсли; 
	НастройкаСоединения	= Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	Если НастройкаСоединения = Неопределено Тогда Возврат;КонецЕсли; 
	Запрос = Новый Запрос;Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_DT_ТранспортноеСообщениеИсходящее.Ссылка КАК Ссылка,
	|	CW_DT_ТранспортноеСообщениеИсходящее.Идентификатор КАК Идентификатор
	|ИЗ
	|	Документ.CW_DT_ТранспортноеСообщениеИсходящее КАК CW_DT_ТранспортноеСообщениеИсходящее
	|ГДЕ
	|	(CW_DT_ТранспортноеСообщениеИсходящее.СостояниеОбмена = ЗНАЧЕНИЕ(Перечисление.CW_DT_СостоянияОбмена.Создан)
	|			ИЛИ CW_DT_ТранспортноеСообщениеИсходящее.СостояниеОбмена = ЗНАЧЕНИЕ(Перечисление.CW_DT_СостоянияОбмена.Зарегистрирован))";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли; 
	HTTPСоединение		= HTTPСоединение(НастройкаСоединения);
	Выборка				= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщение = Выборка.Ссылка.ПолучитьОбъект();
		Если Сообщение.Идентификатор = "" Тогда
			ЗарегистрироватьТранспортноеСообщение(Сообщение,HTTPСоединение,НастройкаСоединения.АдресРесурса);
			Сообщение.Записать();
			//потом Заблокировать доходы
		КонецЕсли; 
		ОтправитьТранспортноеСообщение(Сообщение,HTTPСоединение,НастройкаСоединения.АдресРесурса);
		Сообщение.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗарегистрироватьТранспортноеСообщение(Сообщение,HTTPСоединение,АдресРесурса)
	Попытка
		HTTPЗапрос	= Новый HTTPЗапрос(АдресРесурса + "/message");
		HTTPЗапрос.Заголовки.Вставить("sender_id",	ПолучитьИдентификаторУчастника(Сообщение.Организация));
		HTTPЗапрос.Заголовки.Вставить("sender_key",	ПолучитьПароль(Сообщение.Организация));
		HTTPЗапрос.Заголовки.Вставить("receiver_id",ПолучитьИдентификаторУчастника(Сообщение.Контрагент));
		HTTPЗапрос.Заголовки.Вставить("descrition",	КодироватьСтроку(Сообщение.Описание,СпособКодированияСтроки.КодировкаURL)); 
		HTTPЗапрос.Заголовки.Вставить("value",		КодироватьСтроку(Сообщение.Ценность,СпособКодированияСтроки.КодировкаURL));
		HTTPОтвет	= HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Сообщение.Идентификатор = HTTPОтвет.Заголовки.Получить("message_id");
			Сообщение.СостояниеОбмена = Перечисления.CW_DT_СостоянияОбмена.Зарегистрирован;
			//Сообщить("ЭД зарегистрирован " + Сообщение.Идентификатор);
		Иначе
			CW_Журнал.ЗаписатьСообщение("DataTransfer.ЗарегистрироватьТранспортноеСообщение",0,"Ответ сервиса ("+HTTPОтвет.КодСостояния+") "+HTTPОтвет.ПолучитьТелоКакСтроку());	
		КонецЕсли; 
	Исключение
		CW_Журнал.ЗаписатьСообщение("DataTransfer.ЗарегистрироватьТранспортноеСообщение",0,ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры

Процедура ОтправитьТранспортноеСообщение(Сообщение,HTTPСоединение,АдресРесурса)
	Попытка
		HTTPЗапрос	= Новый HTTPЗапрос(АдресРесурса + "/message");
		HTTPЗапрос.Заголовки.Вставить("sender_id",	ПолучитьИдентификаторУчастника(Сообщение.Организация));
		HTTPЗапрос.Заголовки.Вставить("sender_key",	ПолучитьПароль(Сообщение.Организация));
		HTTPЗапрос.Заголовки.Вставить("message_id",	Сообщение.Идентификатор);
		HTTPЗапрос.УстановитьИмяФайлаТела(ВернутьАрхив(Сообщение)); 
		HTTPОтвет	= HTTPСоединение.Записать(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Сообщение.СостояниеОбмена = Перечисления.CW_DT_СостоянияОбмена.Отправлен;
		Иначе
			CW_Журнал.ЗаписатьСообщение("DataTransfer.ОтправитьТранспортноеСообщение",0,"Ответ сервиса ("+HTTPОтвет.КодСостояния+") "+HTTPОтвет.ПолучитьТелоКакСтроку());	
		КонецЕсли; 
	Исключение
		CW_Журнал.ЗаписатьСообщение("DataTransfer.ОтправитьТранспортноеСообщение",0,ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьСообщения(Организация,ИдентификаторПолучателя,НастройкаСоединения) Экспорт
	Попытка
		HTTPСоединение	= HTTPСоединение(НастройкаСоединения);
		HTTPЗапрос		= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/list");
		HTTPЗапрос.Заголовки.Вставить("receiver_id", ИдентификаторПолучателя);
		HTTPЗапрос.Заголовки.Вставить("receiver_key",ПолучитьПароль(Организация));
		HTTPОтвет		= HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			АттрибутыДат = Новый Массив;
			АттрибутыДат.Добавить("message_date");
			Возврат jsonStrToObject(HTTPОтвет.ПолучитьТелоКакСтроку(),АттрибутыДат)
		Иначе 
			CW_Журнал.ЗаписатьСообщение("DataTransfer.ПолучитьСообщения",0,"Ответ сервиса ("+HTTPОтвет.КодСостояния+") "+HTTPОтвет.ПолучитьТелоКакСтроку());	
		КонецЕсли; 
	Исключение
		CW_Журнал.ЗаписатьСообщение("DataTransfer.ПолучитьСообщения",0,ОписаниеОшибки());	
	КонецПопытки;
	Возврат Новый Массив
КонецФункции

Функция ЗагрузитьСообщение(Заголовки,НастройкаСоединения) Экспорт
	НачатьТранзакцию();
	
	Сообщение     = Документы.CW_DT_ТранспортноеСообщениеВходящее.СоздатьДокумент();
	Сообщение.Дата     = ТекущаяДата();
	Сообщение.Идентификатор  = Заголовки.message_id;
	Сообщение.Организация  = ПолучитьУчастникаПоИдентификатору(Заголовки.receiver_id);
	Сообщение.Контрагент  = ПолучитьУчастникаПоИдентификатору(Заголовки.sender_id);
	Сообщение.ПрофильОбмена  = ПолучитьПрофильОбмена(Сообщение);
	Сообщение.Описание   = Заголовки.description;
	Сообщение.Ценность    = Заголовки.value;
	Если Сообщение.ПрофильОбмена.Пустая() Тогда
		Сообщить("Сообщение не загружено!");
		Возврат Ложь
	КонецЕсли; 
	Попытка
		HTTPСоединение = HTTPСоединение(НастройкаСоединения);
		HTTPЗапрос  = Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/message");
		HTTPЗапрос.Заголовки.Вставить("receiver_id", Заголовки.receiver_id);
		HTTPЗапрос.Заголовки.Вставить("receiver_key", ПолучитьПароль(Сообщение.Организация));
		HTTPЗапрос.Заголовки.Вставить("message_id",  Заголовки.message_id);
		HTTPОтвет  = HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
			Файл = ПолучитьИмяВременногоФайла("zip");HTTPОтвет.ПолучитьТелоКакДвоичныеДанные().Записать(Файл);
			Архив = Новый ЧтениеZipФайла(Файл,Сообщение.ПрофильОбмена.ПарольДляВложений);
			Каталог = КаталогВременныхФайлов()+Сообщение.Идентификатор;
			
			Для Каждого Стр Из Архив.Элементы Цикл Архив.Извлечь(Стр,Каталог);КонецЦикла; 
			
			ТипДокумента = Константы.CW_DT_ТипДокументаФайловогоАрхива.Получить();
			Текст = Новый ТекстовыйДокумент();
			Текст.Прочитать(Каталог + "\register"+Сообщение.Идентификатор+".txt");
			СтруктураАрхива = CW_DT.jsonStrToObject(Текст.ПолучитьТекст());
			
			Сообщение.Записать();
			
			Для Каждого Стр Из СтруктураАрхива Цикл   
				
				ДвоичныеДанные = Новый ДвоичныеДанные(Каталог + "\" + Стр.id);
				Хранение = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
				
				ДанныеФайла = Новый Структура;
				ДанныеФайла.Вставить("Имя",   Стр.name);
				ДанныеФайла.Вставить("Расширение", Стр.ext);
				ДанныеФайла.Вставить("Хранение", Хранение);
				
				ПомещенныйФайл = CW_РаботаСФайламиСервер.ПрикрепитьФайл(ДанныеФайла, Сообщение.Ссылка, ТипДокумента);
				
				нСтр = Сообщение.Вложения.Добавить();
				нСтр.ОбъектАрхива = ПомещенныйФайл;
				нСтр.Тип   = Стр.type;
			КонецЦикла; 
			
			Сообщение.СостояниеОбмена = Перечисления.CW_DT_СостоянияОбмена.Получен;
			Сообщение.Записать();
			УдалитьФайлы(Каталог);
			
			ЗафиксироватьТранзакцию();
			УстановитьСтатусСообщения(Заголовки.message_id,Сообщение.Организация,Заголовки.receiver_id,НастройкаСоединения);
			
			Возврат Истина
		Иначе
			Сообщить(Строка(HTTPОтвет.КодСостояния) + " - "  +HTTPОтвет.ПолучитьТелоКакСтроку());
			Возврат Ложь
		КонецЕсли; 
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		События = Новый СписокЗначений;
		Событие = Новый Структура();
		Событие.Вставить("ИмяСобытия","DataTransfer.ЗагрузитьСообщение");
		Событие.Вставить("ПредставлениеУровня","Ошибка");
		Событие.Вставить("Комментарий",ОписаниеОшибки);
		Событие.Вставить("ДатаСобытия",ТекущаяДата());
		События.Добавить(Событие);
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(События);
		Сообщить(ОписаниеОшибки);
	КонецПопытки;
	Возврат Ложь;	
	
КонецФункции

Функция ПолучитьКлюч(Идентификатор)
	ХешА=Новый ХешированиеДанных(ХешФункция.SHA256);ХешА.Добавить(Идентификатор);
	ХешБ=Новый ХешированиеДанных(ХешФункция.SHA1);ХешБ.Добавить(ХешА.ХешСумма);ХешБ.Добавить(Идентификатор);ХешБ.Добавить(ХешА.ХешСумма);
	Возврат Base64Строка(ХешБ.ХешСумма);
КонецФункции
 
Функция ИдентификаторУчастникаПоИНН(ИНН) Экспорт
	Если НЕ ЗначениеЗаполнено(ИНН) Тогда Возврат "";КонецЕсли; 
	НастройкаСоединения = Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	HTTPСоединение = HTTPСоединение(НастройкаСоединения);
	Попытка
		HTTPЗапрос	= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/member");HTTPЗапрос.Заголовки.Вставить("member_inn",ИНН);
		HTTPОтвет	= HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Возврат HTTPОтвет.ПолучитьТелоКакСтроку()
		ИначеЕсли HTTPОтвет.КодСостояния = 404 Тогда
			Возврат "Не найден"
		Иначе Возврат "Неизвестная ошибка"
		КонецЕсли; 
	Исключение Возврат "Ошибка запроса"	
	КонецПопытки;
КонецФункции

Функция СформироватьИдентификаторУчастникаПоИНН(Участник) Экспорт
	Если НЕ ЗначениеЗаполнено(Участник.ИНН) Тогда Сообщить("ИНН участника не заполнен!");Возврат Ложь;КонецЕсли; 
	НастройкаСоединения = Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	HTTPСоединение = HTTPСоединение(НастройкаСоединения);
	Попытка
		HTTPЗапрос	= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/member");HTTPЗапрос.Заголовки.Вставить("member_inn",СокрЛП(Участник.ИНН));
		HTTPОтвет	= HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			МЗ = РегистрыСведений.CW_DT_ИдентификаторыУчастников.СоздатьМенеджерЗаписи();
			МЗ.Участник = Участник;
			МЗ.Идентификатор = СокрЛП(HTTPОтвет.ПолучитьТелоКакСтроку());
			МЗ.Записать(Истина);Возврат Истина
		ИначеЕсли HTTPОтвет.КодСостояния = 404 Тогда
			Сообщить("Участник не найден в сервисе!");Возврат Ложь
		Иначе Сообщить("Неизвестная ошибка!");Возврат Ложь
		КонецЕсли; 
	Исключение Сообщить("Ошибка HTTP запроса!");Возврат Ложь
	КонецПопытки;
КонецФункции

Функция ПроверитьИдентификаторУчастника(Участник) Экспорт
	Ответ = ПолучитьИдентификаторУчастника(Участник);
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Истина
	Иначе
		Возврат СформироватьИдентификаторУчастникаПоИНН(Участник);	
	КонецЕсли; 
КонецФункции

Функция ПрофильОбменаПоИНН(КонтрагентИНН,ОрганизацияИНН) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ПрофилиОбмена.Ссылка КАК Ссылка,
		|	CW_DT_ПрофилиОбмена.Организация КАК Организация,
		|	CW_DT_ПрофилиОбмена.Контрагент КАК Контрагент,
		|	CW_DT_ПрофилиОбмена.ТипКонвертера КАК ТипКонвертера,
		|	CW_DT_ПрофилиОбмена.ВложениеКонвертера КАК ВложениеКонвертера
		|ИЗ
		|	Справочник.CW_DT_ПрофилиОбмена КАК CW_DT_ПрофилиОбмена
		|ГДЕ
		|	CW_DT_ПрофилиОбмена.Организация.ИНН = &ОрганизацияИНН
		|	И CW_DT_ПрофилиОбмена.Контрагент.ИНН = &КонтрагентИНН";
	Запрос.УстановитьПараметр("КонтрагентИНН",	КонтрагентИНН);
	Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Стру = Новый Структура("Организация,Контрагент,ТипКонвертера,ВложениеКонвертера,Ссылка");
		ЗаполнитьЗначенияСвойств(Стру,Выборка);
		Возврат Стру
	КонецЕсли; 
КонецФункции

Функция ОтправитьНаКонвертацию(XMLДокумента,ИдентификаторСБИС,ПрофильОбмена,ПредставлениеПакета="",finances = Неопределено) Экспорт
	НастройкаСоединения = Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	Попытка
		HTTPСоединение	= HTTPСоединение(НастройкаСоединения);
		HTTPЗапрос		= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/converter");
		HTTPЗапрос.Заголовки.Вставить("sender_id",		ПолучитьИдентификаторУчастника(ПрофильОбмена.Контрагент));
		HTTPЗапрос.Заголовки.Вставить("receiver_id",	ПолучитьИдентификаторУчастника(ПрофильОбмена.Организация));
		HTTPЗапрос.Заголовки.Вставить("receiver_key",	ПолучитьПароль(ПрофильОбмена.Организация));
		HTTPЗапрос.Заголовки.Вставить("converter_type",	ПрофильОбмена.ТипКонвертера);
		
		//Если ЗначениеЗаполнено(finances) Тогда
		//	HTTPЗапрос.Заголовки.Вставить("finances",	finances(finances));
		//КонецЕсли;
		
		HTTPЗапрос.УстановитьТелоИзСтроки(XMLДокумента);
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			//Записать уид
			Идентификатор = HTTPОтвет.ПолучитьТелоКакСтроку();
			ЗаписатьИдентификаторСБИС(Идентификатор,ПрофильОбмена.Ссылка,ИдентификаторСБИС,ПредставлениеПакета);
			Возврат Истина
		Иначе 
			Возврат "Ответ сервиса " + HTTPОтвет.КодСостояния + " - " + HTTPОтвет.ПолучитьТелоКакСтроку()
		КонецЕсли; 
	Исключение
		Возврат ОписаниеОшибки()
	КонецПопытки;
КонецФункции

Функция ОтправитьНаКонвертациюДД(ДД,ИдентификаторСБИС,ПрофильОбмена) Экспорт
	НастройкаСоединения = Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	Попытка
		HTTPСоединение	= HTTPСоединение(НастройкаСоединения);
		HTTPЗапрос		= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/converter");
		HTTPЗапрос.Заголовки.Вставить("sender_id",		ПолучитьИдентификаторУчастника(ПрофильОбмена.Контрагент));
		HTTPЗапрос.Заголовки.Вставить("receiver_id",	ПолучитьИдентификаторУчастника(ПрофильОбмена.Организация));
		HTTPЗапрос.Заголовки.Вставить("receiver_key",	ПолучитьПароль(ПрофильОбмена.Организация));
		HTTPЗапрос.Заголовки.Вставить("converter_type",	ПрофильОбмена.ТипКонвертера);
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДД);
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			//Записать уид
			Идентификатор = HTTPОтвет.ПолучитьТелоКакСтроку();
			//ЗаписатьИдентификаторСБИС(Идентификатор,ПрофильОбмена.Ссылка,ИдентификаторСБИС);
			Возврат Истина
		Иначе 
			Возврат "Ответ сервиса " + HTTPОтвет.КодСостояния + " - " + HTTPОтвет.ПолучитьТелоКакСтроку()
		КонецЕсли; 
	Исключение
		Возврат ОписаниеОшибки()
	КонецПопытки;
КонецФункции

Функция ОтправитьНаКонвертациюНовый(ПрофильОбмена,Тело,ВнешнийИдентификатор = Неопределено) Экспорт
	
	НастройкаСоединения = Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	HTTPСоединение		= HTTPСоединение(НастройкаСоединения);
	HTTPЗапрос			= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/converter");
	
	HTTPЗапрос.Заголовки.Вставить("sender_id",		ПолучитьИдентификаторУчастника(ПрофильОбмена.Контрагент));
	HTTPЗапрос.Заголовки.Вставить("receiver_id",	ПолучитьИдентификаторУчастника(ПрофильОбмена.Организация));
	HTTPЗапрос.Заголовки.Вставить("receiver_key",	ПолучитьПароль(ПрофильОбмена.Организация));
	HTTPЗапрос.Заголовки.Вставить("converter_type",	ПрофильОбмена.ТипКонвертера);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(jsonObjectToStr(Тело));
	
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Если НЕ ВнешнийИдентификатор = Неопределено Тогда
			Идентификатор = HTTPОтвет.ПолучитьТелоКакСтроку();
			ЗаписатьИдентификаторСБИС(Идентификатор,ПрофильОбмена.Ссылка,ВнешнийИдентификатор);
		КонецЕсли; 
		Возврат Истина
	Иначе 
		Возврат "Ответ сервиса " + HTTPОтвет.КодСостояния + " - " + HTTPОтвет.ПолучитьТелоКакСтроку()
	КонецЕсли; 
	
КонецФункции

Функция УстановитьСтатусСообщения(message_id,Участник,ИдентификаторУчастника,НастройкаСоединения) Экспорт
	Попытка
		HTTPСоединение	= HTTPСоединение(НастройкаСоединения);
		HTTPЗапрос		= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/message");
		HTTPЗапрос.Заголовки.Вставить("member_id",	ИдентификаторУчастника);
		HTTPЗапрос.Заголовки.Вставить("member_key",	ПолучитьПароль(Участник));
		HTTPЗапрос.Заголовки.Вставить("message_id",	message_id);
		HTTPОтвет = HTTPСоединение.Изменить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда Возврат Истина
		Иначе Сообщить(Строка(HTTPОтвет.КодСостояния) + " - "  + HTTPОтвет.ПолучитьТелоКакСтроку());Возврат Ложь
			//CW_Журнал.ЗаписатьСообщение("DataTransfer.ЗагрузитьСообщение",0,"Ответ сервиса ("+HTTPОтвет.КодСостояния+") "+HTTPОтвет.ПолучитьТелоКакСтроку());	
		КонецЕсли; 
	Исключение Сообщить(ОписаниеОшибки());Возврат Ложь
		//CW_Журнал.ЗаписатьСообщение("DataTransfer.ЗагрузитьСообщение",0,ОписаниеОшибки());	
	КонецПопытки;
КонецФункции

Функция HTTPСоединение(НастройкаСоединения) Экспорт
	Возврат	Новый HTTPСоединение(НастройкаСоединения.АдресСервера,НастройкаСоединения.Порт,,,,,?(НастройкаСоединения.ЗащищенноеСоединение,Новый ЗащищенноеСоединениеOpenSSL(),Неопределено))
КонецФункции

Функция finances(finances)
	
	Файл	= ПолучитьИмяВременногоФайла();
    Запись	= Новый ЗаписьТекста(Файл,КодировкаТекста.UTF8);
    Запись.Записать(jsonObjectToStr(finances));
    Запись.Закрыть();
    
    ДД		= Новый ДвоичныеДанные(Файл);
    Ответ	= Base64Строка(ДД);
	УдалитьФайлы(Файл);
	Возврат Ответ 
	
КонецФункции


#КонецОбласти 

#Область xml
//отправка
Функция СформироватьXML(Ссылка,ПрофильОбмена) Экспорт
	Попытка
		ИмяФайла			= ПолучитьИмяВременногоФайла("xml"); 
		ЗаписьXML			= Новый ЗаписьXML; 
		ПараметрыЗаписиXML	= Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь); 
		ЗаписьXML.ОткрытьФайл(ИмяФайла);
		ЗаписьXML.ЗаписатьОбъявлениеXML();  
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML,XDTOПоСсылке(Ссылка,ПрофильОбмена)); 
		ЗаписьXML.Закрыть(); 
		Возврат ИмяФайла
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;
КонецФункции

Функция XDTOПоСсылке(Ссылка,ПрофильОбмена)
	
	root		= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","root"));	
	finances	= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","finances"));	
	contract	= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","contract"));
	services	= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","services"));
	service		= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","service"));
	units		= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","units"));
	
	contract.id			= XMLСтрока(Ссылка.Договор);
	contract.number		= Ссылка.Договор.НомерДоговора;
	contract.date		= Ссылка.Договор.ДатаДоговора;
	//contract.currency	= Ссылка.Договор.ВалютаДоговора.Код;//?(Ссылка.Договор.ВалютаДоговора.Код = "643","RUB",Ссылка.Договор.ВалютаДоговора.Наименование);
	
	finances.id			= XMLСтрока(Ссылка);
	finances.correction	= Ложь;//Ссылка.Корректировка;
	finances.sum		= Ссылка.СуммаДокумента;	
	finances.currency	= Ссылка.Валюта.Код;	
	finances.comment	= Ссылка.Комментарий;
	finances.contract	= contract;
	finances.bill		= Ссылка.ФормируетсяСчет;
	finances.act		= Ссылка.ФормируетсяАкт;
	finances.invoice	= Ссылка.ФормируетсяСчетФактура;
	
	Если finances.bill Тогда
		finances.bill_number= CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчета", "ДатаСчета");
		finances.bill_date	= Ссылка.ДатаСчета;
	Иначе
		finances.bill_list	= Ссылка.СписокСчетов;
		Если НЕ finances.bill_list Тогда
			finances.bill_id	= ?(Ссылка.Счет.Пустая(),"",XMLСтрока(Ссылка.Счет));
			finances.bill_rep	= ?(Ссылка.Счет.Пустая(),"",Ссылка.Счет.ПредставлениеДокумента);
		КонецЕсли; 
	КонецЕсли; 
	Если finances.act Тогда
		finances.act_number	= CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерАкта", "ДатаАкта");
		finances.act_date	= Ссылка.ДатаАкта;
	КонецЕсли; 
	Если finances.invoice Тогда
		finances.invoice_number		= CW_Документы.ПолучитьНомерНаПечать(Ссылка.ВедомыйСчетФактура);
		finances.invoice_date		= Ссылка.ДатаСчетаФактуры;
		//finances.invoice_seller_id	= ?(Ссылка.Продавец.Пустая(),"",XMLСтрока(Ссылка.Продавец));
		//finances.invoice_seller_rep	= ?(Ссылка.Продавец.Пустая(),"",Ссылка.Продавец.ПолноеНаименование);
	КонецЕсли; 
	
	//Услуги
	Для Каждого Стр Из Ссылка.Услуги Цикл
		service				= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.coralway.ru","service"));
		service.id			= XMLСтрока(Стр.Номенклатура);	
		service.rep			= Стр.Представление;	
		service.unit_id		= XMLСтрока(Стр.Грузоперевозка);	
		service.quantity	= Стр.Количество;	
		service.price		= Стр.Цена;	
		service.sum			= Стр.Сумма;	
		service.vat_rate	= Строка(Стр.СтавкаНДС);	
		service.vat_amt		= Стр.НДС;	
		service.total		= Стр.Всего;
		Если Ссылка.СписокСчетов Тогда
			service.bill_id		= ?(Стр.Счет.Пустая(),"",XMLСтрока(Стр.Счет));	
			service.bill_rep	= ?(Стр.Счет.Пустая(),"",Стр.Счет.ПредставлениеДокумента);
		КонецЕсли; 
		services.service.Добавить(service);	
	КонецЦикла; 
	
	finances.services = services;
	
	//Грузоперевозки подробно
	Грузоперевозки	= Ссылка.Услуги.Выгрузить(,"Грузоперевозка");Грузоперевозки.Свернуть("Грузоперевозка");
	unit_type		= ФабрикаXDTO.Тип("http://www.coralway.ru","unit");
	prop_type		= unit_type.Свойства.Получить("properties").Тип;
	
	Для Каждого Стр Из Грузоперевозки.ВыгрузитьКолонку("Грузоперевозка") Цикл
		unit		= ФабрикаXDTO.Создать(unit_type);
		unit.id		= XMLСтрока(Стр);
		unit.rep	= Стр.CW_Представление;
		СформироватьПараметры(unit.properties,prop_type,Стр,ПрофильОбмена);
		СформироватьИдентификаторыИсточника(unit.parental_id,Стр,ПрофильОбмена,CW_Обмены_ПИ.МетаданноеКонфигурации("Справочник.CW_Грузоперевозки"));
		units.unit.Добавить(unit);
	КонецЦикла; 
	
	root.finances	= finances;
	root.units		= units;
	
	Возврат root
	
КонецФункции

Функция СформироватьИдентификаторыИсточника(parental_id,Грузоперевозка,ПрофильОбмена,ТипМетаданных,СмотретьВУказанныхПрофилях = Истина)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_Синхронизация.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.CW_DT_Синхронизация КАК CW_DT_Синхронизация
		|ГДЕ
		|	CW_DT_Синхронизация.ПрофильОбмена = &ПрофильОбмена
		|	И CW_DT_Синхронизация.ТипМетаданных = &ТипМетаданных
		|	И CW_DT_Синхронизация.Ссылка = &Грузоперевозка";
	Запрос.УстановитьПараметр("ПрофильОбмена",	ПрофильОбмена);
	Запрос.УстановитьПараметр("Грузоперевозка",	Грузоперевозка);
	Запрос.УстановитьПараметр("ТипМетаданных",	ТипМетаданных);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() И ПрофильОбмена.ПолучатьСинхронизациюИзУказанныхПрофилей И СмотретьВУказанныхПрофилях Тогда
		Для Каждого Профиль Из ПрофильОбмена.ПрофилиОбмена Цикл
			Если СформироватьИдентификаторыИсточника(parental_id,Грузоперевозка,Профиль.ПрофильОбмена,ТипМетаданных,Ложь) Тогда
				Прервать;	
			КонецЕсли; 	
		КонецЦикла; 
	Иначе 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			parental_id.Добавить(Выборка.Идентификатор);
		КонецЦикла;
		Возврат Истина;
	КонецЕсли; 
КонецФункции
 
Процедура СформироватьПараметры(properties,prop_type,Ссылка,ПрофильОбмена)
	Для Каждого СтрОбмена Из ПрофильОбмена.ОтправкаПараметров.НайтиСтроки(Новый Структура("Отправлять",Истина))  Цикл
		Если ТипЗнч(СтрОбмена.Параметр) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
			Нашли = Ссылка.ПараметрыГрузоперевозки.Найти(СтрОбмена.Параметр);
			Если НЕ Нашли = Неопределено И ЗначениеЗаполнено(Нашли.Значение) Тогда
				property			= ФабрикаXDTO.Создать(prop_type);
				property.property	= СтрОбмена.Идентификатор;
				property.value		= Строка(Нашли.Значение);
				properties.Добавить(property)	
			КонецЕсли; 
		Иначе
			property			= ФабрикаXDTO.Создать(prop_type);
			property.property	= СтрОбмена.Идентификатор;
			property.value		= Строка(Ссылка[XMLстрока(СтрОбмена.Параметр)]);
			properties.Добавить(property)	
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

//получение
Процедура ЗаполнитьФормуИзXML(Форма,ПолноеИмяФайла,Отказ) Экспорт
	
	//Проверим организацию в сервисе
	Отказ		= Истина;
	member_id	= ПолучитьИдентификаторУчастника(Форма.Организация);
	member_key	= ПолучитьПароль(Форма.Организация);
	
	Если НЕ ЗначениеЗаполнено(member_id) ИЛИ НЕ ЗначениеЗаполнено(member_key) Тогда Сообщить(Форма.Организация.Наименование + " организация не настроена для работы с сервисом!");Возврат;КонецЕсли;
	
	//НастройкаСоединения	= Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();Если НастройкаСоединения = Неопределено Тогда Сообщить("Нет настройки соединения!");Возврат;КонецЕсли; 
	//HTTPСоединение		= HTTPСоединение(НастройкаСоединения);
	//HTTPЗапрос			= Новый HTTPЗапрос(НастройкаСоединения.АдресРесурса + "/member");
	//HTTPЗапрос.Заголовки.Вставить("member_id",	member_id);
	//HTTPЗапрос.Заголовки.Вставить("member_key",	member_key);
	//
	//Если НЕ HTTPСоединение.ПолучитьЗаголовки(HTTPЗапрос).КодСостояния = 200 Тогда Сообщить(Форма.Организация.Наименование + " организация не зарегистрирована в сервисе!");Возврат;КонецЕсли;
		
	Отказ		= Ложь;
	СтавкиНДС	= Новый Соответствие;
	Для Каждого Стр Из Перечисления.СтавкиНДС Цикл
		СтавкиНДС.Вставить(НРег(Строка(Стр)),Стр);	
	КонецЦикла; 
	
	ЧтениеXML	= Новый ЧтениеXML;ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	
	root		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Форма.ПредъявленСчет	= root.finances.bill;
	Форма.ПредъявленАкт		= root.finances.act;
	Форма.ПредъявленСФ		= root.finances.invoice;
	Форма.ВалютаСообщения	= ПолучитьВалютуПоКоду(root.finances.currency);
	
	Если Форма.ПредъявленСчет Тогда
		Форма.НомерСчета			= root.finances.bill_number;
		Форма.ДатаСчета				= XMLЗначение(Тип("Дата"),root.finances.bill_date);
	Иначе
		Форма.СписокСчетов			= root.finances.bill_list;
		Форма.СчетИдентификатор		= root.finances.bill_id;
		Форма.СчетПредставление		= root.finances.bill_rep;
	КонецЕсли; 
	
	Если Форма.ПредъявленАкт Тогда
		Форма.НомерАкта				= root.finances.act_number;
		Форма.ДатаАкта				= XMLЗначение(Тип("Дата"),root.finances.act_date);
	КонецЕсли; 
	
	Если Форма.ПредъявленСФ Тогда
		Форма.НомерСФ				= root.finances.invoice_number;
		Форма.ДатаСФ				= XMLЗначение(Тип("Дата"),root.finances.invoice_date);
		//Форма.ПродавецИдентификатор	= root.finances.invoice_seller_id;
		//Форма.ПродавецПредставление	= root.finances.invoice_seller_rep;
	КонецЕсли; 	
	
	Если НЕ root.finances.Свойства().Получить("id") = Неопределено Тогда
		Форма.РасходыИдентификатор	= root.finances.id;
	КонецЕсли; 
	
	Форма.ДоговорИдентификатор	= root.finances.contract.id;
	Форма.ДоговорПредставление	= root.finances.contract.number+" от "+ФорматДатыXML(root.finances.contract.date);
	Форма.ДоговорНомер			= root.finances.contract.number;
	Форма.ДоговорДата			= XMLЗначениеДата(root.finances.contract.date);
	
	Для Каждого unit Из CW_DT.xdtoObjectToList(root.units.unit) Цикл
		нСтр = Форма.Грузоперевозки.Добавить();
		нСтр.Идентификатор = unit.id;
		нСтр.Представление = unit.rep;
		properties = unit.Свойства().Получить("properties");
		Если НЕ properties = Неопределено Тогда
			Для Каждого property Из CW_DT.xdtoObjectToList(unit.properties) Цикл
				ДобавитьСтрокуПараметра(Форма,property,нСтр);	
			КонецЦикла; 
		КонецЕсли;
		parental_id = unit.Свойства().Получить("parental_id");
		Если НЕ parental_id = Неопределено Тогда
			Если ТипЗнч(unit.parental_id) = Тип("Строка") Тогда
				нСтр.Грузоперевозка = ПолучитьГрузоперевозкуПоИдентификатору(unit.parental_id);
			Иначе
				Для Каждого id Из unit.parental_id Цикл
					Грузоперевозка = ПолучитьГрузоперевозкуПоИдентификатору(id);		
					Если НЕ Грузоперевозка = Неопределено Тогда нСтр.СписокГрузоперевозок.Добавить().Грузоперевозка = Грузоперевозка;КонецЕсли; 
				КонецЦикла; 
				нСтр.ДоступенСписокГрузоперевозок = нСтр.СписокГрузоперевозок.Количество();
			КонецЕсли; 	
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого Стр Из CW_DT.xdtoObjectToList(root.finances.services.service) Цикл
		нСтр = Форма.Услуги.ПолучитьЭлементы().Добавить();
		нСтр.Учитывать						= Истина;
		нСтр.ГрузоперевозкаИдентификатор	= Стр.unit_id;
		нСтр.НоменклатураИдентификатор		= Стр.id;
		нСтр.Представление					= Стр.rep;
		нСтр.Количество						= Стр.quantity;
		нСтр.Цена							= Стр.price;
		нСтр.Сумма							= Стр.sum;
		нСтр.СтавкаНДС						= СтавкиНДС.Получить(НРег(Стр.vat_rate));
		нСтр.НДС							= Стр.vat_amt;
		нСтр.Всего							= Стр.total;
		нСтр.НомерСтроки					= Форма.Услуги.ПолучитьЭлементы().Количество();
		Если НЕ Форма.УникальнаяНоменклатура.НайтиСтроки(Новый Структура("Идентификатор",Стр.id)).Количество() Тогда
			нСтр = Форма.УникальнаяНоменклатура.Добавить();
			нСтр.Идентификатор = Стр.id;
			нСтр.Представление = Стр.rep;
		КонецЕсли; 
		Если Форма.СписокСчетов И НЕ Форма.УникальныеСчета.НайтиСтроки(Новый Структура("Идентификатор",Стр.bill_id)).Количество() Тогда
			нСтр = Форма.УникальныеСчета.Добавить();
			нСтр.Идентификатор = Стр.bill_id;
			нСтр.Представление = Стр.bill_rep;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

Процедура ДобавитьСтрокуПараметра(Форма,property,нСтр)
	ннСтр				= нСтр.Параметры.Добавить();
	ннСтр.Идентификатор	= property.property;
	ннСтр.Значение		= property.value;
	ПараметрыНастройки	= Форма.ПрофильОбмена.ПолучениеПараметров.НайтиСтроки(Новый Структура("Идентификатор",ннСтр.Идентификатор)); 
	Если ПараметрыНастройки.Количество() Тогда
		ЗаполнитьЗначенияСвойств(ннСтр,ПараметрыНастройки[0],"Параметр,Отбор,Создание,Сценарий");
		Если НЕ ннСтр.Сценарий.Пустая() Тогда
			Справочники.CW_DT_Сценарии.ВыполнитьСценарий(ннСтр);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьГрузоперевозкуПоИдентификатору(Идентификатор)
	Попытка Возврат Справочники.CW_Грузоперевозки.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));	
	Исключение;Сообщить("В базе отсутствует полученная грузоперевозка " + Идентификатор)КонецПопытки;
КонецФункции
 
Функция ФорматДатыXML(Дата)
	Попытка
		Возврат Формат(XMLЗначение(Тип("Дата"),Дата),"ДФ=dd.MM.yyyy");	
	Исключение
		Возврат Дата;	
	КонецПопытки; 
КонецФункции

Функция XMLЗначениеДата(Дата)
	Попытка
		Возврат XMLЗначение(Тип("Дата"),Дата);	
	Исключение
		Возврат '00010101'	
	КонецПопытки; 
КонецФункции

Функция ПолучитьВалютуПоКоду(Код)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Код = &Код";
	Запрос.УстановитьПараметр("Код", Код);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

#КонецОбласти 

#Область json
Функция jsonObjectToStr(object) Экспорт
	json = Новый ЗаписьJSON;
	json.УстановитьСтроку();
	ЗаписатьJSON(json,object);       
	Возврат json.Закрыть()
	//jsonpref= Новый НастройкиСериализацииJSON; //jsonpref.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
КонецФункции
Функция jsonStrToObject(str,dateatt = Неопределено) Экспорт
	json= Новый ЧтениеJSON; 
	json.УстановитьСтроку(str);
	Возврат ПрочитатьJSON(json,,?(dateatt = Неопределено,Новый Массив,dateatt));
КонецФункции
#КонецОбласти 

#Область xdto
Функция xdtoObjectToList(Object)Экспорт
	Если ТипЗнч(Object) = Тип("ОбъектXDTO") Тогда
		List = Новый Массив;List.Добавить(Object);Возврат List
	КонецЕсли;
	Возврат Object
КонецФункции
#КонецОбласти 



//////непонятно

Процедура ЗаписатьИдентификаторСБИС(Ссылка,ПрофильОбмена,Идентификатор,Представление = "")
	
	ТипМетаданных = Справочники.CW_МетаданныеКонфигурации.НайтиПоНаименованию("sbis_id");
	
	НЗ = РегистрыСведений.CW_DT_Синхронизация.СоздатьНаборЗаписей();
	НЗ.Отбор.ПрофильОбмена.Установить(ПрофильОбмена);
	НЗ.Отбор.Идентификатор.Установить(Идентификатор);
	НЗ.Отбор.ТипМетаданных.Установить(ТипМетаданных);
	НЗ.Прочитать();
	НЗ.Очистить();
	
	Запись = НЗ.Добавить();
	Запись.ПрофильОбмена		= ПрофильОбмена;
	Запись.Идентификатор		= Идентификатор;
	Запись.Ссылка				= Ссылка;
	Запись.ТипМетаданных		= ТипМетаданных;
	Запись.Представление		= Представление;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры 

Функция СуществуетИдентификаторСБИС(Идентификатор,ПрофильОбмена) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_Синхронизация.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.CW_DT_Синхронизация КАК CW_DT_Синхронизация
		|ГДЕ
		|	CW_DT_Синхронизация.ПрофильОбмена = &ПрофильОбмена
		|	И CW_DT_Синхронизация.Идентификатор = &Идентификатор
		|	И CW_DT_Синхронизация.ТипМетаданных.Наименование = ""sbis_id""";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ПрофильОбмена", ПрофильОбмена);
	Возврат НЕ Запрос.Выполнить().Пустой()	
КонецФункции

Функция ПолучитьИдентификаторСБИС(Идентификатор,ПрофильОбмена) Экспорт
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_Синхронизация.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.CW_DT_Синхронизация КАК CW_DT_Синхронизация
		|ГДЕ
		|	CW_DT_Синхронизация.ПрофильОбмена = &ПрофильОбмена
		|	И CW_DT_Синхронизация.Ссылка = &Идентификатор
		|	И CW_DT_Синхронизация.ТипМетаданных.Наименование = ""sbis_id""";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ПрофильОбмена", ПрофильОбмена);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	Возврат Выборка.Идентификатор	
КонецФункции


Процедура Инициализация()
	//ДопСвойствоИдентификатор = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
	//ДопСвойствоИдентификатор.Родитель = 
		
КонецПроцедуры

Функция ПроверитьВозможностьВыгрузки() Экспорт
	Возврат _УФКС.Ответ()		
КонецФункции
